# Pandas Training Book

### Why I made this notebook?

This Notebook is here to train the Pandas Library. 
It contains quizzles for all fundamental Pandas attributes, methods and more. 
The goal is to **master the mechanics through repetition**. 
The work here is based on the book "Python Data Science Handbook" written by Jack VanderPlas, which I really enjoyed reading.

### Requirements

You should know the theory behind numpy and have an understanding why the following tasks work.
This book is just about knowing how to use the code.

### Let's get started

#### Task 1 Installation

1.1 Import Pandas

In [1]:
import pandas as pd

In [2]:
#enter solution

1.2 Show Pandas version

In [3]:
pd.__version__

'1.0.3'

In [4]:
#enter solution

1.3 Import the other library, that panda works with

In [5]:
import numpy as np

In [6]:
#enter solution

#### Task 2 Introducing Pandas Objects

2.1 Create a pandas series with the values 1, 2 , 3 , 4 and save it in the variable **data**

In [7]:
data = pd.Series([1, 2, 3, 4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
#enter solution

2.2 Get the values from the **data** object

In [9]:
data.values

array([1, 2, 3, 4], dtype=int64)

In [10]:
#enter solution

2.3 Show the index-range from the **data** object

In [11]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
#enter solution

2.4 Get the second item from the **data** object

In [13]:
data[1]

2

In [14]:
#enter solution

2.5 Get the values from index 1 to 2

In [15]:
data[1:3]

1    2
2    3
dtype: int64

In [16]:
#enter solution

2.6 create a pandas series with the values 1, 2, 3, 4 and indices a, b, c, d and save it in the varibale **data**

In [17]:
data = pd.Series([1,2,3,4], index=["a", "b", "c", "d"])
data

a    1
b    2
c    3
d    4
dtype: int64

In [18]:
#enter solution

2.7 Get the item for the index "b"

In [19]:
data["b"]

2

In [20]:
#enter solution

2.8 Create a dictionary with the keys "Person1", "Person2", "Person3", "Person4" and the values, 12 ,13 ,15 ,11
save it as **person_dict**. Create a pandas series out of this dictionary and save it as **person_pd**.

In [21]:
person_dict = {"Person1": 12, "Person2": 13, "Person3": 15, "Person4": 11}
print(person_dict)
person_pd = pd.Series(person_dict)
person_pd

{'Person1': 12, 'Person2': 13, 'Person3': 15, 'Person4': 11}

Person1    12
Person2    13
Person3    15
Person4    11
dtype: int64

In [22]:
#enter solution

2.9 Get the values for Person3

In [23]:
person_pd["Person3"]

15

In [24]:
#enter solution

2.10 Get the values from Person2 to Person4

In [25]:
person_pd["Person2":"Person4"]

Person2    13
Person3    15
Person4    11
dtype: int64

In [26]:
#enter solution

2.11 Get a pandas series from the following dictionary with only index 3 and 2

In [27]:
test_dict = {2: "a", 3: "c", 1: "a"}

data = pd.Series(test_dict, index= [3,2])
data

3    c
2    a
dtype: object

In [28]:
#enter solution

#### Task 3 Pandas DataFrame Object

3.1 Create two dictionaries named person_number_dict and person_wage dict with the keys "Person1", "Person2", "Person3", "Person4". 
The values for person_number_dict: 123 , 124 , 125 , 126
The values for person_wage_dict: 10000, 12000 , 9000, 5000

In [29]:
person_number_dict = {"Person1": 123, "Person2": 124, "Person3": 125, "Person4": 126}
person_wage_dict = {"Person1": 10000, "Person2": 12000, "Person3": 9000, "Person4": 5000}

In [30]:
#enter solution

3.2 Create two pandas series with the dictionaries before. Named person_number_pd and person_wage_pd.

In [31]:
person_number_pd = pd.Series(person_number_dict)
person_wage_pd = pd.Series(person_wage_dict)

In [32]:
#enter solution

3.3 Create a data frame with the index set as "Person1", "Person2" ... etc. and the column named as "per. number" and "wage". Fill in the pandas series from before. Save it in the variable **data**

In [33]:
data = pd.DataFrame({"per. number": person_number_pd, "wage": person_wage_pd})
print(data)

         per. number   wage
Person1          123  10000
Person2          124  12000
Person3          125   9000
Person4          126   5000

In [34]:
#enter solution

3.4 Get the indices from the **data** set

In [35]:
data.index

Index(['Person1', 'Person2', 'Person3', 'Person4'], dtype='object')

In [36]:
#enter solution

3.5 Get the column names from the **data** set

In [37]:
data.columns

Index(['per. number', 'wage'], dtype='object')

In [38]:
#enter solution

3.6 Get the column for "wage" from the **data** set

In [39]:
data["wage"]

Person1    10000
Person2    12000
Person3     9000
Person4     5000
Name: wage, dtype: int64

In [40]:
#enter solution

#### Task 4 Create Panda DataFrames

4.1 Create a Panda DataFrame from **person_wage_pd**

In [41]:
data = pd.DataFrame(person_wage_pd, columns= ["wage"])
data

          wage
Person1  10000
Person2  12000
Person3   9000
Person4   5000

In [42]:
#enter solution

4.2 Create a Panda DataFrame from the given dictionary

In [43]:
x_dict = [{"a":i ,"b":i*2 , "c": i**3} for i in range(3)]

pd.DataFrame(x_dict)

   a  b  c
0  0  0  0
1  1  2  1
2  2  4  8

In [44]:
x_dict = [{"a":i ,"b":i*2 , "c": i**3} for i in range(3)]

#enter solution

4.3 Create a Panda DataFrame from the two following dictionaries

In [45]:
x_dict = {"a": 1, "b": 2}
y_dict = {"b": 4, "c": 3}

x_pd = pd.DataFrame([x_dict, y_dict])
x_pd

     a  b    c
0  1.0  2  NaN
1  NaN  4  3.0

In [46]:
x_dict = {"a": 1, "b": 2}
y_dict = {"b": 4, "c": 3}

#enter solution

4.4 Create a Panda DataFrame from the following Numpy array and lists

In [47]:
np.random.seed(42)
np_data = np.random.rand(3,2)
cols = ["foo", "bar"]
ind = ["a", "b", "c"]

pd.DataFrame(np_data, columns=cols, index= ind)

        foo       bar
a  0.374540  0.950714
b  0.731994  0.598658
c  0.156019  0.155995

In [48]:
np.random.seed(42)
np_data = np.random.rand(3,2)
cols = ["foo", "bar"]
ind = ["a", "b", "c"]

#enter solution

4.5 Get the intersection of the follwing two indices

In [49]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [50]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

#enter solution

4.6 Get the union of **indA** and **indB**

In [51]:
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [52]:
#enter solution

4.7 Get the symmetric difference of **indA** and **indB**

In [53]:
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

In [54]:
#enter solution

#### Task 5 Data Indexing and Selection 

5.1 Add 1.25 as index "e" to the Series below

In [55]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index= ["a", "b", "c", "d"])
data["e"] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [56]:
#enter solution

5.2 Get all data between 0.3 and 0.8 from **data**

In [57]:
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [58]:
#enter solution

5.3 Get the explicit index 1 from the following data set

In [59]:
data = pd.DataFrame(["a", "b", "c", "d", "e"], index= [1,2,3,4,5],columns= ["First"])
print(data)
data.loc[1]

  First
1     a
2     b
3     c
4     d
5     e

First    a
Name: 1, dtype: object

In [60]:
data = pd.DataFrame(["a", "b", "c", "d", "e"], index= [1,2,3,4,5],columns= ["First"])

#enter solution

5.4 Get the implicit index 1 from **data**

In [61]:
data.iloc[1]

First    b
Name: 2, dtype: object

In [62]:
#enter solution

5.5 Add a column "Yearly wage" with the wages x12 for the following dataset.

In [63]:
person_wage_dict = {"Person1": 10000, "Person2": 12000, "Person3": 7000, "Person4":5000}
person_number_dict = {"Person1": 123, "Person2": 124, "Person3": 125, "Person4": 126}
person_wage_pd = pd.Series(person_wage_dict)
person_number_pd = pd.Series(person_number_dict)
data = pd.DataFrame({"Person Number": person_number_pd,"Person wage": person_wage_pd})
print(data)

data["Yearly wage"] = data["Person wage"] * 12
data

         Person Number  Person wage
Person1            123        10000
Person2            124        12000
Person3            125         7000
Person4            126         5000

         Person Number  Person wage  Yearly wage
Person1            123        10000       120000
Person2            124        12000       144000
Person3            125         7000        84000
Person4            126         5000        60000

In [64]:
person_wage_dict = {"Person1": 10000, "Person2": 12000, "Person3": 7000, "Person4":5000}
person_number_dict = {"Person1": 123, "Person2": 124, "Person3": 125, "Person4": 126}
person_wage_pd = pd.Series(person_wage_dict)
person_number_pd = pd.Series(person_number_dict)
data = pd.DataFrame({"Person Number": person_number_pd,"Person wage": person_wage_pd})

#enter solution

5.6 Get the values from **data** as a NumPy array

In [65]:
data.values

array([[  123, 10000],
       [  124, 12000],
       [  125,  7000],
       [  126,  5000]], dtype=int64)

In [66]:
#enter solution

5.7 Transpose **data**

In [67]:
data.T

               Person1  Person2  Person3  Person4
Person Number      123      124      125      126
Person wage      10000    12000     7000     5000

In [68]:
#enter solution

5.8 Get the second row from **data** as a NumPy array

In [69]:
data.values[1]

array([  124, 12000], dtype=int64)

In [70]:
#enter solution

5.9 Get the column for ***Person wage*** from **data**

In [71]:
data["Person wage"]

Person1    10000
Person2    12000
Person3     7000
Person4     5000
Name: Person wage, dtype: int64

In [72]:
#enter solution

5.10 Get the implicit indices for the first three rows and first two columns from **data**

In [73]:
data.iloc[:3, :2]

         Person Number  Person wage
Person1            123        10000
Person2            124        12000
Person3            125         7000

In [74]:
#enter solution

5.11 Get the data for Person1 to Person3 and the columns Person number and Person wage from **data**

In [75]:
data.loc[:"Person3", : "Person wage"]

         Person Number  Person wage
Person1            123        10000
Person2            124        12000
Person3            125         7000

In [76]:
#enter solution

#### Task 6 Operations in Pandas

6.1 Add the following Series together and fill the missing values in A or B with 0

In [79]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])

A.add(B, fill_value= 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [80]:
#enter solution

6.2 Add the following Series together and replace missing values in **A** with the mean of **A.stack()**

In [102]:
A = pd.DataFrame(np.random.randint(0,20, (2,2)),columns=list("AB"))
B = pd.DataFrame(np.random.randint(0,10, (3,3)),columns=list("BAC"))
print(A)
print(B)
fill = A.stack().mean()
print(A.add(B, fill_value=fill))

    A   B
0  14   8
1  19  16
   B  A  C
0  0  9  3
1  6  1  2
2  0  4  0
       A      B      C
0  23.00   8.00  17.25
1  20.00  22.00  16.25
2  18.25  14.25  14.25

In [ ]:
#enter solution

6.3 Substract **B** from **A** (use Pandas operator and Pandas method)

In [107]:
A - B
A.sub(B)

      A     B   C
0   5.0   8.0 NaN
1  18.0  10.0 NaN
2   NaN   NaN NaN

In [108]:
#enter solution

6.4 Multiply **A** with **B** (use Pandas operator and Pandas method)

In [109]:
A * B
A.mul(B)

       A     B   C
0  126.0   0.0 NaN
1   19.0  96.0 NaN
2    NaN   NaN NaN

In [110]:
#enter solution

6.5 Divide **A** by **B** (use Pandas operator and Pandas method)

In [116]:
A / B
A.div(B)

           A         B   C
0   1.555556       inf NaN
1  19.000000  2.666667 NaN
2        NaN       NaN NaN

In [117]:
#enter solution

6.6 Get the modulus of **A** divided by **B** (use Pandas operator and Pandas method)

In [119]:
A % B
A.mod(B)

     A    B   C
0  5.0  NaN NaN
1  0.0  4.0 NaN
2  NaN  NaN NaN

In [120]:
#enter solution

6.7 Get **A** to the power of **B** (use Pandas operator and Pandas method)

In [123]:
A ** B
A.pow(B)

              A           B    C
0  2.066105e+10         1.0  NaN
1  1.900000e+01  16777216.0  NaN
2           NaN         1.0  1.0

In [124]:
#enter solution

#### Task 7 Handling missing data

7.1 Get the sum of the following array

In [128]:
data = np.array([1, np.nan, 3, 4])

np.nansum(data)

8.0

In [129]:
data = np.array([1, np.nan, 3, 4])

#enter solution

7.2 Get the minimum from **data**

In [130]:
np.nanmin(data)

1.0

In [131]:
#enter solution

7.3 Get the maximum from **data**

In [132]:
np.nanmax(data)

4.0

In [133]:
#enter solution

7.4 Check which elements are Null values in the following Series

In [134]:
data = pd.Series([1, np.nan, "hello", None])

data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [135]:
#enter solution

7.5 Get the elements in a new Series whithout Null values

In [142]:
data[data.isnull() == False]
#or
data[data.notnull()]
#or
data.dropna()

0        1
2    hello
dtype: object

In [139]:
#enter solution

7.6 Drop the elements that are Null values from the following DataFrame

In [144]:
data = pd.DataFrame([[1, np.nan, 2 ],
                     [2, 3 ,5 ],
                     [np.nan, 4, 6 ]])
print(data)
data.dropna()

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

     0    1  2
1  2.0  3.0  5

In [145]:
#enter solution

7.7 Drop the columns with Null value elements from **data**

In [146]:
data.dropna(axis= "columns")

   2
0  2
1  5
2  6

In [147]:
#enter solution

7.8 Add a column with Null value to **data**

In [149]:
data[3] = np.nan
data

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [150]:
#enter solution

7.9 Drop only the columns where all elements are Null value from **data**

In [151]:
data.dropna(axis= "columns", how= "all")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [152]:
#enter solution

7.10 Fill the following Null values with zeros

In [157]:
data = pd.Series([1, np.nan, 2, None, 3], index= list("abcde"))
print(data)
data.fillna(0)

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [158]:
#enter solution

7.11 Forward-fill the missing data with the previous value

In [159]:
data.fillna(method= "ffill")

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [160]:
#enter solution

7.12 Back-fill the missing data with the next value backwards

In [163]:
data.fillna(method= "bfill")

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [ ]:
#enter solution

#### Task 8 Hierachical Indexing

8.1  Set a multi-index with the following list of tuples

In [166]:
index = [("California", 2000), ("California", 2010), ("New York", 2000), 
         ("New York", 2010), ("Texas", 2000), ("Texas", 2010)]

index = pd.MultiIndex.from_tuples(index)
print(index)

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [ ]:
#enter solution

8.2 Create a Series with the following populations and multi-index **index**

In [169]:
populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

pop = pd.Series(populations, index = index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [170]:
#enter solution

8.3 Get the data for all cities in the year 2010 from pop

In [173]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [174]:
#enter solution

8.4 Convert the multi-index **pop** to a simple DataFrame

In [175]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [176]:
#enter solution

8.5 Convert the DataFrame back to a multi-index DataFrame

In [ ]:
#enter solution

In [178]:
pop_df = pop_df.stack()
pop_df

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

8.6 Add the following list as a new column to the **pop_df** and name it "under18", name the first column "total"

In [181]:
under18 = [9267089, 9284094, 4687374, 4318033, 5906301, 6879014]

pop_df = pd.DataFrame({"total": pop, "under18": under18})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [182]:
#enter solution

8.7 Add a third column that shows the fraction in percent numbers of under18 from the total and name it "fu18"

In [191]:
pop_df["fu18"] = (pop_df["under18"] / pop_df["total"]) *100 
pop_df

                    total  under18       fu18
California 2000  33871648  9267089  27.359428
           2010  37253956  9284094  24.921096
New York   2000  18976457  4687374  24.700997
           2010  19378102  4318033  22.283054
Texas      2000  20851820  5906301  28.325110
           2010  25145561  6879014  27.356773

In [192]:
#enter solution

8.8 Create a multi-index from arrays using:
   
    [["a", "a", "b", "b"], [1,2,1,2]]

In [193]:
[["a", "a", "b", "b"], [1,2,1,2]]

pd.MultiIndex.from_arrays([["a", "a", "b", "b"], [1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [194]:
#enter solution

8.9 Create the same multi-index from tuples

In [195]:
pd.MultiIndex.from_tuples([("a",1),("a", 2),("b", 1), ("b",2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [196]:
#enter solution

8.10 Create the same multi-index from a Cartesian product

In [197]:
pd.MultiIndex.from_product([["a", "b"], [1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [ ]:
#enter solution

8.11 Create the same multi-index from using levels and labels

In [212]:
pd.MultiIndex(levels=[["a","b"],[1,2]], codes= [[0,0,1,1], [0,1,0,1]])

# In the book the key-word says "labels" instead "codes". If you read the docstring by putting the command 
# below you can see, that it got updated.
#pd.MultiIndex?

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [211]:
#enter solution

8.12 Set the names attribute for the two indices from **pop_df** "state" and "year"

In [214]:
pop_df.index.names= ["state", "year"]
pop_df

                    total  under18       fu18
state      year
California 2000  33871648  9267089  27.359428
           2010  37253956  9284094  24.921096
New York   2000  18976457  4687374  24.700997
           2010  19378102  4318033  22.283054
Texas      2000  20851820  5906301  28.325110
           2010  25145561  6879014  27.356773

In [215]:
#enter solution

8.13 Set the multi-index for index and columns with the following code provided

In [218]:
index = pd.MultiIndex.from_product([[2013, 2014], [1,2]], names= ["year", "visit"])
columns = pd.MultiIndex.from_product([["Bob", "Guido", "Sue"], ["HR", "Temp"]], names= ["subject", "type"])
data = np.round(np.random.randn(4,6), 1)
data[:,::2] *= 10
data += 37

df = pd.DataFrame(data, index= index, columns= columns)
print(df)

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.0  36.8  44.0  38.1  19.0  38.2
     2      27.0  35.9   8.0  36.2  37.0  36.6
2014 1      32.0  35.9  46.0  38.0  41.0  35.1
     2      60.0  37.1  42.0  35.5  37.0  37.4

In [219]:
index = pd.MultiIndex.from_product([[2013, 2014], [1,2]], names= ["year", "visit"])
columns = pd.MultiIndex.from_product([["Bob", "Guido", "Sue"], ["HR", "Temp"]], names= ["subject", "type"])
data = np.round(np.random.randn(4,6), 1)
data[:,::2] *= 10
data += 37

#enter solution

8.14 Get the full data for "Guido"

In [220]:
df["Guido"]

type          HR  Temp
year visit
2013 1      44.0  38.1
     2       8.0  36.2
2014 1      46.0  38.0
     2      42.0  35.5

In [234]:
#enter solution

8.15 Get the data for "California" in the year 2000 for **pop**

In [236]:
pop["California", 2000]

33871648

In [237]:
#enter solution

8.16 Get the full data for "California"

In [238]:
pop["California"]

year
2000    33871648
2010    37253956
dtype: int64

In [239]:
#enter solution

8.17 Get the data for "California" to "New York"

In [240]:
pop.loc["California": "New York"]

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [241]:
#enter solution

8.18 Get all data for the year 2000

In [242]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [243]:
#enter solution

8.19 Get all data that is over 22'000'000

In [244]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [245]:
#enter solution

8.20 Get the data for "California" and "Texas"

In [ ]:
#enter solution

In [246]:
pop[["California", "Texas"]]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

8.21 Get the data for subject "Bob" and type "HR" from **df**

In [248]:
df["Guido", "HR"]

year  visit
2013  1        44.0
      2         8.0
2014  1        46.0
      2        42.0
Name: (Guido, HR), dtype: float64

In [249]:
#enter solution

8.22 Get the data for the first two rows and first two columns

In [250]:
df.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      46.0  36.8
     2      27.0  35.9

In [251]:
#enter solution

8.23 Get the data for rows: all "years" and only "visit" 2 and columns: all "subjects" and only type "HR"

In [254]:
idx = pd.IndexSlice
df.loc[idx[:,2], idx[:,"HR"]]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 2      27.0   8.0  37.0
2014 2      60.0  42.0  37.0

In [255]:
#enter solution

8.24 Sort the index alphabetically

In [258]:
index = pd.MultiIndex.from_product([["a", "c", "b"], [1,2]])
data = pd.Series(np.random.rand(6), index= index)
data.index.names=["char", "int"]
print(data)
data = data.sort_index()
data

char  int
a     1      0.552820
      2      0.296510
c     1      0.419781
      2      0.256207
b     1      0.611514
      2      0.081594
dtype: float64

char  int
a     1      0.552820
      2      0.296510
b     1      0.611514
      2      0.081594
c     1      0.419781
      2      0.256207
dtype: float64

In [259]:
#enter solution

8.25 Unstack **pop** at the first index level ("state")

In [265]:
print(pop)
pop.unstack(level=0)

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [266]:
#enter solution

8.26 Unstack **pop** at the second index level ("year")

In [267]:
print(pop)
pop.unstack(level=1)

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [268]:
#enter solution

8.27 Reset the index as columns in **pop** and save it in **pop_flat**, name the column with population data "population"

In [273]:
pop_flat = pop.reset_index(name= "population")
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [274]:
#enter solution

8.28 Set the indices back to "state" and "year" in **pop_flat**

In [275]:
pop_flat.set_index(["state", "year"])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [276]:
#enter solution

8.29 Get the mean for the visits in each year for every subject and type.

In [278]:
print(df)
df_mean = df.mean(level="year")
df_mean

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.0  36.8  44.0  38.1  19.0  38.2
     2      27.0  35.9   8.0  36.2  37.0  36.6
2014 1      32.0  35.9  46.0  38.0  41.0  35.1
     2      60.0  37.1  42.0  35.5  37.0  37.4

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     36.5  36.35  26.0  37.15  28.0  37.40
2014     46.0  36.50  44.0  36.75  39.0  36.25

In [279]:
#enter solution

8.30 Get the mean for all type "HR" and "Temp" in each year

In [280]:
df_mean.mean(axis=1, level="type")

type         HR       Temp
year
2013  30.166667  36.966667
2014  43.000000  36.500000

In [281]:
#enter solution

#### Task 9 Concatenation of NumPy Arrays and Pandas

9.1 Concatenate the following lists horizontally to a NumPy array

In [282]:
x= [1,2,3]
y= [4,5,6]
z= [7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [283]:
x= [1,2,3]
y= [4,5,6]
z= [7,8,9]

#enter solution

9.2 Concatenate the following list of lists with itself horizontally to a NumPy array

In [285]:
x= [[1,2],
   [3,4]]
np.concatenate([x,x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [286]:
x= [[1,2],
   [3,4]]

#enter solution

9.3 Concatenate the two Panda Series

In [287]:
ser1 = pd.Series(["A", "B", "C"], index=[1,2,3])
ser2 = pd.Series(["D", "E", "F"], index=[4,5,6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [288]:
ser1 = pd.Series(["A", "B", "C"], index=[1,2,3])
ser2 = pd.Series(["D", "E", "F"], index=[4,5,6])

#enter solution

9.4 Change the index so ser2 gets added horizontally to ser1

In [293]:
ser1 = pd.Series(["A", "B", "C"], index=[1,2,3])
ser2 = pd.Series(["D", "E", "F"], index=[1,2,3])
pd.concat([ser1,ser2], axis=1)

   0  1
1  A  D
2  B  E
3  C  F

In [294]:
#enter solution

ser1 = pd.Series(["A", "B", "C"], index=[1,2,3])
ser2 = pd.Series(["D", "E", "F"], index=[4,5,6])

9.5 Concatenate the two following DataFrames

In [298]:
#function to create a DataFrame quickly
def make_df(cols,ind):
    """Quickly make a DataFrame"""
    data= {c: [str(c) + str(i) for i in ind]
          for c in cols}
    return pd.DataFrame(data,ind)

df1 = make_df("AB", [1,2])
df2 = make_df("AB", [3,4])
print(df1), print(df2) , print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

(None, None, None)

In [322]:
#function to create a DataFrame quickly
def make_df(cols,ind):
    """Quickly make a DataFrame"""
    data= {c: [str(c) + str(i) for i in ind]
          for c in cols}
    return pd.DataFrame(data,ind)

df1 = make_df("AB", [1,2])
df2 = make_df("AB", [3,4])

#enter solution

9.6 Concatenate the two following DataFrames in the same index

In [323]:
df3 = make_df("AB", [0,1])
df4 = make_df("CD", [0,1])
print(df3), print(df4), print(pd.concat([df3,df4], axis= "columns"))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

(None, None, None)

In [324]:
df3 = make_df("AB", [0,1])
df4 = make_df("CD", [0,1])

#enter solution

9.7 Set the index of the following DataFrame **y** to the same index as **x** and concatenate the two together.

In [325]:
x = make_df("AB", [0,1])
y = make_df("AB", [2,3])

y.index = x.index
print(x), print(y), print(pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

(None, None, None)

In [326]:
x = make_df("AB", [0,1])
y = make_df("AB", [2,3])

#enter solution

9.8 Concatenate the previous two df's again, but with the right index

In [332]:
y.index = x.index
pd.concat([x,y], ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [328]:
#enter solution

9.9 Concatenate the previous two df's again, but set keys x and y to the index series

In [333]:
pd.concat([x,y], keys=["x", "y"])

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [346]:
#enter solution

9.10 Concatenate the two following df's

In [354]:
df5 = make_df("ABC", [1,2])
df6 = make_df("BCD", [3,4])

print(df5), print(df6), print(pd.concat([df5,df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

(None, None, None)

In [355]:
df5 = make_df("ABC", [1,2])
df6 = make_df("BCD", [3,4])

#enter solution

9.11 Concatenate the columns of the previous two df's that they have in common

In [356]:
pd.concat([df5,df6], join="inner")

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [350]:
#enter solution

9.12 Append **df2** to **df1**

In [376]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [362]:
#enter solution

#### Task 10 Combining Datasets: Merge and Join

10.1  Merge the two following df's

In [383]:
df1 = pd.DataFrame({"employee": ["Bob", "Jake", "Lisa", "Sue"], 
                    "group": ["Accounting", "Engineering", "Engineering", "HR"]})
df2 = pd.DataFrame({"employee": ["Lisa", "Bob", "Jake", "Sue"], "hire_date": [2004,2008,2012,2014]})
print(df1),print(df2)
df3 = df1.merge(df2)
print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [380]:
df1 = pd.DataFrame({"employee": ["Bob", "Jake", "Lisa", "Sue"], 
                    "group": ["Accounting", "Engineering", "Engineering", "HR"]})
df2 = pd.DataFrame({"employee": ["Lisa", "Bob", "Jake", "Sue"], "hire_date": [2004,2008,2012,2014]})

#enter solution

10.2 Merge **df3** with the following df

In [386]:
df4 = pd.DataFrame({"group": ["Accounting", "Engineering", "HR"], "supervisor": ["Carly", "Guido", "Steve"]})
print(df3), print(df4)
df3.merge(df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [387]:
df4 = pd.DataFrame({"group": ["Accounting", "Engineering", "HR"], "supervisor": ["Carly", "Guido", "Steve"]})

#enter solution

10.3 Merge **df1** with the following df

In [388]:
df5 = pd.DataFrame({"group": ["Accounting", "Accounting", "Engineering", "Engineering", "HR", "HR"], 
                    "skills": ["math", "spreadsheet", "coding", "linux", "spreadsheet", "organization"]})
df1.merge(df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting   spreadsheet
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR   spreadsheet
7      Sue           HR  organization

In [389]:
df5 = pd.DataFrame({"group": ["Accounting", "Accounting", "Engineering", "Engineering", "HR", "HR"], 
                    "skills": ["math", "spreadsheet", "coding", "linux", "spreadsheet", "organization"]})

#enter solution

10.4 Merge **df1** and **df2** by the column "employee"

In [392]:
print(df1), print(df2)
print(pd.merge(df1,df2, on="employee"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [393]:
#enter solution

10.5 Merge df1 with the following df considering different labels for the same column

In [394]:
df3 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], 
                    "salary": [70000, 80000, 120000, 90000]})
print(df1), print(df3), print(pd.merge(df1,df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

(None, None, None)

In [395]:
df3 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], 
                    "salary": [70000, 80000, 120000, 90000]})

#enter solution

10.6 Merge df1 with df3 considering different labels for the same column and drop the column "name"

In [397]:
pd.merge(df1,df3, left_on= "employee", right_on= "name").drop("name", axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [398]:
#enter solution

10.7 Set the indices from **df1** and **df2** to "employee" and save it as **df1a** and **df2a**

In [399]:
df1a = df1.set_index("employee")
df2a = df2.set_index("employee")

print(df1a), print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

(None, None)

In [401]:
#enter solution

10.8 Merge **df1a** and **df2a** by index

In [404]:
pd.merge(df1a, df2a, left_index=True, right_index=True)
#or
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [405]:
#enter solution

10.9 Merge the following two df's, getting only the intersection of the two df's

In [407]:
df6 = pd.DataFrame({"name": ["Peter", "Paul", "Mary"], 
                    "food": ["fish", "beans", "bread"]}, 
                   columns= ["name", "food"])
df7 = pd.DataFrame({"name": ["Mary", "Joseph"], 
                    "drink": ["wine", "beer"]},
                   columns= ["name", "drink"])
print(df6), print(df7), print(pd.merge(df6,df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

(None, None, None)

In [408]:
df6 = pd.DataFrame({"name": ["Peter", "Paul", "Mary"], 
                    "food": ["fish", "beans", "bread"]}, 
                   columns= ["name", "food"])
df7 = pd.DataFrame({"name": ["Mary", "Joseph"], 
                    "drink": ["wine", "beer"]},
                   columns= ["name", "drink"])

#enter solution

10.10 Merge **df6** and **df7**, getting the union of the two df's

In [409]:
pd.merge(df6,df7, how= "outer")

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [410]:
#enter solution

10.11 Merge **df6** and **df7**, getting only range of df6

In [413]:
pd.merge(df6,df7, how="left")

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [414]:
#enter solution

10.11 Merge **df6** and **df7**, getting only range of df7

In [415]:
pd.merge(df6,df7, how="right")

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [416]:
#enter solution

10.12 Merge the following df's, getting both data for the same column name

In [417]:
df8 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], 
                   "rank": [1,2,3,4]})
df9 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"],
                   "rank": [3,1,4,2]})

print(df8), print(df9), print(pd.merge(df8,df9, on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

(None, None, None)

In [418]:
df8 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], 
                   "rank": [1,2,3,4]})
df9 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"],
                   "rank": [3,1,4,2]})

#enter solution

10.13 Merge **df8** and **df9**, getting both data for the same column name and change the suffix to _L and _R

In [419]:
pd.merge(df8,df9, on="name", suffixes= ["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [420]:
#enter solution

#### Task 11 Example: US States Data

Downloading Datasets from Github

In [421]:
!curl -0 https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
!curl -0 https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
!curl -0 https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

state/region,ages,year,population
AL,under18,2012,1117489
AL,total,2012,4817528
AL,under18,2010,1130966
AL,total,2010,4785570
AL,under18,2011,1125763
AL,total,2011,4801627
AL,total,2009,4757938
AL,under18,2009,1134192
AL,under18,2013,1111481
AL,total,2013,4833722
AL,total,2007,4672840
AL,under18,2007,1132296
AL,total,2008,4718206
AL,under18,2008,1134927
AL,total,2005,4569805
AL,under18,2005,1117229
AL,total,2006,4628981
AL,under18,2006,1126798
AL,total,2004,4530729
AL,under18,2004,1113662
AL,total,2003,4503491
AL,under18,2003,1113083
AL,total,2001,4467634
AL,under18,2001,1120409
AL,total,2002,4480089
AL,under18,2002,1116590
AL,under18,1999,1121287
AL,total,1999,4430141
AL,total,2000,4452173
AL,under18,2000,1122273
AL,total,1998,4404701
AL,under18,1998,1118252
AL,under18,1997,1122893
AL,total,1997,4367935
AL,total,1996,4331103
AL,total,1995,4296800
AL,under18,1995,1110553
AL,under18,1996,1112092
AL,total,1994,4260229
AL,total,1993,4214202
AL,under18,1993,1085606
AL,under18,1994,1097180
AL,under18,1992,1072873
AL,total,1992,4154014
AL,total,1991,4099156
AL,under18,1991,1060794
AL,under18,1990,1050041
AL,total,1990,4050055
AK,total,1990,553290
AK,under18,1990,177502
AK,total,1992,588736
AK,under18,1991,182180
AK,under18,1992,184878
AK,total,1994,603308
AK,under18,1994,187439
AK,total,1991,570193
AK,total,1993,599434
AK,under18,1993,187190
AK,total,1995,604412
AK,under18,1995,184990
AK,total,1996,608569
AK,under18,1996,185360
AK,under18,1997,188280
AK,under18,1998,192636
AK,total,1998,619933
AK,total,1997,612968
AK,under18,1999,191422
AK,total,1999,624779
AK,total,2000,627963
AK,under18,2000,190615
AK,total,2001,633714
AK,under18,2001,188771
AK,total,2002,642337
AK,under18,2002,188482
AK,total,2003,648414
AK,under18,2003,186843
AK,total,2004,659286
AK,under18,2004,186335
AK,total,2005,666946
AK,under18,2005,185304
AK,total,2006,675302
AK,under18,2006,185580
AK,total,2007,680300
AK,under18,2007,184344
AK,total,2008,687455
AK,under18,2008,183124
AK,under18,2013,188132
AK,total,2013,735132
AK,total,2009,698895
AK,under18,2009,186351
AK,under18,2010,187902
AK,total,2010,713868
AK,under18,2011,188329
AK,total,2011,723375
AK,under18,2012,188162
AK,total,2012,730307
AZ,under18,2012,1617149
AZ,total,2012,6551149
AZ,under18,2011,1616353
AZ,total,2011,6468796
AZ,under18,2010,1628563
AZ,total,2010,6408790
AZ,under18,2013,1616814
AZ,total,2013,6626624
AZ,total,2009,6343154
AZ,under18,2009,1627343
AZ,total,2007,6167681
AZ,under18,2007,1607895
AZ,total,2008,6280362
AZ,under18,2008,1628651
AZ,total,2005,5839077
AZ,under18,2005,1529168
AZ,total,2006,6029141
AZ,under18,2006,1574867
AZ,total,2004,5652404
AZ,under18,2004,1484454
AZ,total,2003,5510364
AZ,under18,2003,1453671
AZ,total,2001,5273477
AZ,under18,2001,1399015
AZ,total,2002,5396255
AZ,under18,2002,1427938
AZ,under18,1999,1332396
AZ,total,1999,5023823
AZ,total,2000,5160586
AZ,under18,2000,1373414
AZ,total,1998,4883342
AZ,under18,1998,1285794
AZ,total,1997,4736990
AZ,under18,1997,1237159
AZ,under18,1996,1215285
AZ,total,1996,4586940
AZ,total,1995,4432499
AZ,under18,1995,1173391
AZ,total,1993,4065440
AZ,under18,1993,1094233
AZ,under18,1994,1119857
AZ,total,1994,4245089
AZ,under18,1992,1055572
AZ,under18,1991,1028285
AZ,total,1991,3788576
AZ,total,1992,3915740
AZ,under18,1990,1006040
AZ,total,1990,3684097
AR,under18,1990,620933
AR,total,1990,2356586
AR,total,1991,2383144
AR,under18,1991,626212
AR,under18,1992,638269
AR,total,1992,2415984
AR,under18,1994,653842
AR,total,1994,2494019
AR,total,1993,2456303
AR,under18,1993,643474
AR,under18,1995,667671
AR,total,1995,2535399
AR,under18,1996,677912
AR,total,1996,2572109
AR,under18,1998,683637
AR,total,1997,2601091
AR,under18,1997,680203
AR,total,1998,2626289
AR,total,2000,2678588
AR,under18,2000,680378
AR,under18,1999,681940
AR,total,1999,2651860
AR,total,2002,2705927
AR,under18,2002,678798
AR,total,2001,2691571
AR,under18,2001,679606
AR,total,2004,2749686
AR,under18,2004,683166
AR,total,2003,2724816
AR,under18,2003,679579
AR,total,2006,2821761
AR,under18,2006,697842
AR,total,2005,2781097
AR,under18,2005,689787
AR,total,2008,2874554
AR,under18,2008,705725
AR,total,2007,2848650
AR,under18,2007,702737
AR,total,2009,2896843
AR,under18,2009,707886
AR,under18,2013,709866
AR,total,2013,2959373
AR,under18,2011,710576
AR,total,2011,2938506
AR,under18,2010,711947
AR,total,2010,2922280
AR,under18,2012,710471
AR,total,2012,2949828
CA,under18,2012,9209007
CA,total,2012,37999878
CA,under18,2011,9252336
CA,total,2011,37668681
CA,under18,2010,9284094
CA,total,2010,37333601
CA,under18,2013,9174877
CA,total,2013,38332521
CA,total,2009,36961229
CA,under18,2009,9294501
CA,total,2007,36250311
CA,under18,2007,9335620
CA,total,2008,36604337
CA,under18,2008,9321621
CA,total,2005,35827943
CA,under18,2005,9405565
CA,total,2006,36021202
CA,under18,2006,9370884
CA,total,2003,35253159
CA,under18,2003,9404594
CA,total,2004,35574576
CA,under18,2004,9418497
CA,total,2001,34479458
CA,under18,2001,9325466
CA,total,2002,34871843
CA,under18,2002,9365142
CA,under18,1999,9207878
CA,total,1999,33499204
CA,total,2000,33987977
CA,under18,2000,9267089
CA,under18,1998,9163238
CA,total,1998,32987675
CA,under18,1997,9135359
CA,total,1997,32486010
CA,under18,1996,9079519
CA,total,1996,32018834
CA,total,1995,31696582
CA,under18,1995,8920578
CA,total,1993,31274928
CA,under18,1993,8624810
CA,under18,1994,8790058
CA,total,1994,31484435
CA,total,1991,30470736
CA,under18,1991,8245605
CA,under18,1992,8439647
CA,total,1992,30974659
CA,under18,1990,7980501
CA,total,1990,29959515
CO,total,1990,3307618
CO,under18,1990,881640
CO,total,1992,3495939
CO,under18,1992,925577
CO,under18,1991,896537
CO,total,1991,3387119
CO,total,1994,3724168
CO,under18,1994,966412
CO,under18,1993,947806
CO,total,1993,3613734
CO,under18,1995,984310
CO,total,1995,3826653
CO,total,1996,3919972
CO,under18,1996,1003946
CO,under18,1997,1030557
CO,total,1997,4018293
CO,total,1998,4116639
CO,under18,1998,1060066
CO,total,2000,4326921
CO,under18,2000,1106676
CO,total,1999,4226018
CO,under18,1999,1083938
CO,total,2002,4490406
CO,under18,2002,1138273
CO,total,2001,4425687
CO,under18,2001,1126647
CO,total,2004,4575013
CO,under18,2004,1146369
CO,total,2003,4528732
CO,under18,2003,1144597
CO,total,2006,4720423
CO,under18,2006,1171832
CO,total,2005,4631888
CO,under18,2005,1156399
CO,total,2008,4889730
CO,under18,2008,1203289
CO,total,2007,4803868
CO,under18,2007,1189434
CO,total,2009,4972195
CO,under18,2009,1217213
CO,under18,2013,1237932
CO,total,2013,5268367
CO,under18,2010,1226619
CO,total,2010,5048196
CO,under18,2011,1230178
CO,total,2011,5118400
CO,under18,2012,1232864
CO,total,2012,5189458
CT,under18,2012,794959
CT,total,2012,3591765
CT,under18,2011,805109
CT,total,2011,3588948
CT,under18,2010,814187
CT,total,2010,3579210
CT,under18,2013,785566
CT,total,2013,3596080
CT,total,2009,3561807
CT,under18,2009,820839
CT,total,2007,3527270
CT,under18,2007,833484
CT,total,2008,3545579
CT,under18,2008,826626
CT,total,2005,3506956
CT,under18,2005,844034
CT,total,2006,3517460
CT,under18,2006,839372
CT,total,2003,3484336
CT,under18,2003,851115
CT,total,2004,3496094
CT,under18,2004,848979
CT,total,2001,3432835
CT,under18,2001,845850
CT,total,2002,3458749
CT,under18,2002,848877
CT,total,1999,3386401
CT,under18,1999,834654
CT,total,2000,3411777
CT,under18,2000,842242
CT,under18,1998,824600
CT,total,1998,3365352
CT,total,1997,3349348
CT,under18,1997,814373
CT,under18,1996,811855
CT,total,1996,3336685
CT,total,1995,3324144
CT,under18,1995,808623
CT,total,1993,3309175
CT,under18,1993,790749
CT,under18,1994,801231
CT,total,1994,3316121
CT,under18,1991,766304
CT,total,1991,3302895
CT,under18,1992,777264
CT,total,1992,3300712
CT,total,1990,3291967
CT,under18,1990,752666
DE,under18,1990,165628
DE,total,1990,669567
DE,under18,1992,174166

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 57935  100 57935    0     0   175k      0 --:--:-- --:--:-- --:--:--  176k

DE,total,1992,694927
DE,total,1991,683080
DE,under18,1991,169910
DE,total,1994,717545
DE,under18,1994,180833
DE,total,1993,706378
DE,under18,1993,176916
DE,under18,1995,181736
DE,total,1995,729735
DE,total,1996,740978
DE,under18,1996,184021
DE,under18,1997,186607
DE,total,1997,751487
DE,total,1998,763335
DE,under18,1998,189302
DE,total,2000,786373
DE,under18,2000,194914
DE,total,1999,774990
DE,under18,1999,192510
DE,total,2002,806169
DE,under18,2002,196946
DE,total,2001,795699
DE,under18,2001,196038
DE,total,2004,830803
DE,under18,2004,199631
DE,total,2003,818003
DE,under18,2003,198045
DE,total,2006,859268
DE,under18,2006,203729
DE,total,2005,845150
DE,under18,2005,201988
DE,total,2008,883874
DE,under18,2008,206116
DE,total,2007,871749
DE,under18,2007,205155
DE,under18,2013,203558
DE,total,2013,925749
DE,total,2009,891730
DE,under18,2009,206213
DE,under18,2010,205478
DE,total,2010,899711
DE,under18,2011,204801
DE,total,2011,907985
DE,under18,2012,204586
DE,total,2012,917053
DC,under18,2012,107642
DC,total,2012,633427
DC,under18,2011,103906
DC,total,2011,619624
DC,under18,2010,101309
DC,total,2010,605125
DC,under18,2013,111474
DC,total,2013,646449
DC,total,2009,592228
DC,under18,2009,102098
DC,total,2007,574404
DC,under18,2007,104126
DC,total,2008,580236
DC,under18,2008,102257
DC,total,2005,567136
DC,under18,2005,107187
DC,total,2006,570681
DC,under18,2006,105651
DC,total,2003,568502
DC,under18,2003,111403
DC,total,2004,567754
DC,under18,2004,109756
DC,total,2001,574504
DC,under18,2001,114625
DC,total,2002,573158
DC,under18,2002,113822
DC,total,1999,570220
DC,under18,1999,115003
DC,total,2000,572046
DC,under18,2000,114503
DC,under18,1998,113839
DC,total,1998,565232
DC,under18,1997,119531
DC,total,1997,567739
DC,under18,1996,121210
DC,total,1996,572379
DC,total,1995,580519
DC,under18,1995,123620
DC,total,1993,595302
DC,under18,1993,120471
DC,under18,1994,122170
DC,total,1994,589240
DC,total,1991,600870
DC,under18,1991,116825
DC,under18,1992,118636
DC,total,1992,597567
DC,under18,1990,112632
DC,total,1990,605321
FL,total,1990,13033307
FL,under18,1990,2988807
FL,under18,1991,3045638
FL,total,1991,13369798
FL,total,1994,14239444
FL,under18,1994,3299887
FL,under18,1993,3214066
FL,total,1993,13927185
FL,total,1992,13650553
FL,under18,1992,3120439
FL,under18,1995,3366468
FL,total,1995,14537875
FL,total,1996,14853360
FL,under18,1996,3431695
FL,under18,1998,3557561
FL,under18,1997,3502269
FL,total,1997,15186304
FL,total,1998,15486559
FL,total,1999,15759421
FL,under18,1999,3611711
FL,total,2000,16047515
FL,under18,2000,3654880
FL,total,2001,16356966
FL,under18,2001,3714439
FL,total,2002,16689370
FL,under18,2002,3774624
FL,total,2003,17004085
FL,under18,2003,3820876
FL,total,2004,17415318
FL,under18,2004,3890734
FL,total,2005,17842038
FL,under18,2005,3968178
FL,total,2006,18166990
FL,under18,2006,4022912
FL,total,2007,18367842
FL,under18,2007,4031098
FL,total,2008,18527305
FL,under18,2008,4018372
FL,total,2009,18652644
FL,under18,2009,3997283
FL,under18,2013,4026674
FL,total,2013,19552860
FL,under18,2010,3999532
FL,total,2010,18846054
FL,under18,2011,4002550
FL,total,2011,19083482
FL,under18,2012,4012421
FL,total,2012,19320749
GA,total,2012,9915646
GA,under18,2012,2487831
GA,under18,2011,2488898
GA,total,2011,9810181
GA,under18,2010,2490884
GA,total,2010,9713248
GA,total,2013,9992167
GA,total,2009,9620846
GA,under18,2009,2485781
GA,under18,2013,2489709
GA,total,2007,9349988
GA,under18,2007,2456249
GA,total,2008,9504843
GA,under18,2008,2479097
GA,total,2005,8925922
GA,under18,2005,2353604
GA,total,2006,9155813
GA,under18,2006,2406014
GA,total,2003,8622793
GA,under18,2003,2278710
GA,total,2004,8769252
GA,under18,2004,2308855
GA,total,2001,8377038
GA,under18,2001,2215390
GA,total,2002,8508256
GA,under18,2002,2249784
GA,total,1999,8045965
GA,under18,1999,2130698
GA,total,2000,8227303
GA,under18,2000,2176576
GA,total,1997,7685099
GA,under18,1997,2034163
GA,under18,1998,2078998
GA,total,1998,7863536
GA,under18,1996,1993171
GA,total,1996,7501069
GA,total,1995,7328413
GA,under18,1995,1949818
GA,under18,1992,1817781
GA,total,1992,6817203
GA,total,1993,6978240
GA,under18,1993,1865021
GA,under18,1994,1906539
GA,total,1994,7157165
GA,total,1991,6653005
GA,under18,1991,1773675
GA,under18,1990,1747363
GA,total,1990,6512602
HI,under18,1990,279983
HI,total,1990,1113491
HI,total,1991,1136754
HI,under18,1991,287871
HI,under18,1994,307517
HI,total,1994,1187536
HI,total,1993,1172838
HI,under18,1993,301473
HI,under18,1992,295124
HI,total,1992,1158613
HI,total,1995,1196854
HI,under18,1995,310325
HI,under18,1996,311213
HI,total,1996,1203755
HI,under18,1998,304576
HI,total,1998,1215233
HI,total,1997,1211640
HI,under18,1997,309465
HI,total,2000,1213519
HI,under18,2000,295352
HI,total,1999,1210300
HI,under18,1999,299680
HI,total,2002,1239613
HI,under18,2002,293600
HI,total,2001,1225948
HI,under18,2001,294133
HI,total,2004,1273569
HI,under18,2004,298103
HI,total,2003,1251154
HI,under18,2003,294519
HI,total,2006,1309731
HI,under18,2006,299313
HI,total,2005,1292729
HI,under18,2005,298497
HI,total,2008,1332213
HI,under18,2008,301094
HI,total,2007,1315675
HI,under18,2007,300207
HI,under18,2013,307266
HI,total,2009,1346717
HI,under18,2009,302796
HI,total,2013,1404054
HI,total,2010,1363731
HI,under18,2010,303812
HI,total,2011,1376897
HI,under18,2011,305396
HI,under18,2012,305981
HI,total,2012,1390090
ID,total,2012,1595590
ID,under18,2012,427177
ID,under18,2011,428535
ID,total,2011,1583930
ID,under18,2010,428961
ID,total,2010,1570718
ID,total,2013,1612136
ID,total,2009,1554439
ID,under18,2009,426076
ID,under18,2013,427781
ID,total,2007,1505105
ID,under18,2007,415024
ID,total,2008,1534320
ID,under18,2008,422347
ID,total,2005,1428241
ID,under18,2005,394651
ID,total,2006,1468669
ID,under18,2006,404753
ID,total,2003,1363380
ID,under18,2003,379241
ID,total,2004,1391802
ID,under18,2004,384692
ID,total,2001,1319962
ID,under18,2001,373145
ID,total,2002,1340372
ID,under18,2002,375986
ID,total,1999,1275674
ID,under18,1999,366689
ID,total,2000,1299430
ID,under18,2000,370430
ID,total,1997,1228520
ID,under18,1997,357779
ID,under18,1998,362189
ID,total,1998,1252330
ID,under18,1996,353824
ID,total,1996,1203083
ID,total,1995,1177322
ID,under18,1995,349248
ID,under18,1992,324972
ID,total,1992,1071685
ID,total,1993,1108768
ID,under18,1993,333838
ID,under18,1994,344242
ID,total,1994,1145140
ID,total,1991,1041316
ID,under18,1991,316732
ID,under18,1990,313373
ID,total,1990,1012384
IL,under18,1990,2940837
IL,total,1990,11453316
IL,total,1991,11568964
IL,under18,1991,2988715
IL,under18,1994,3110938
IL,total,1994,11912585
IL,total,1993,11809579
IL,under18,1993,3066541
IL,under18,1992,3033427
IL,total,1992,11694184
IL,total,1995,12008437
IL,under18,1995,3152984
IL,under18,1996,3192916
IL,total,1996,12101997
IL,under18,1998,3225252
IL,total,1998,12271847
IL,total,1997,12185715
IL,under18,1997,3222114
IL,total,2000,12434161
IL,under18,2000,3244944
IL,total,1999,12359020
IL,under18,1999,3240034
IL,total,2002,12525556
IL,under18,2002,3238362
IL,total,2001,12488445
IL,under18,2001,3243617
IL,total,2004,12589773
IL,under18,2004,3211599
IL,total,2003,12556006
IL,under18,2003,3225547
IL,total,2006,12643955
IL,under18,2006,3181246
IL,total,2005,12609903
IL,under18,2005,3197318
IL,total,2008,12747038
IL,under18,2008,3153401
IL,total,2007,12695866
IL,under18,2007,3170134
IL,under18,2013,3023307
IL,total,2009,12796778
IL,under18,2009,3138406
IL,total,2013,12882135
IL,total,2010,12839695
IL,under18,2010,3122092
IL,total,2011,12855970
IL,under18,2011,3089833
IL,under18,2012,3057042
IL,total,2012,12868192
IN,total,2012,6537782
IN,under18,2012,1589655
IN,under18,2011,1598091
IN,total,2011,6516336
IN,under18,2010,1605883
IN,total,2010,6489965
IN,total,2013,6570902
IN,total,2009,6459325
IN,under18,2009,1609704
IN,under18,2013,1586027
IN,total,2007,6379599
IN,under18,2007,1609494
IN,total,2008,6424806
IN,under18,2008,1611494
IN,total,2005,6278616
IN,under18,2005,1593898
IN,total,2006,6332669
IN,under18,2006,1603107
IN,total,2003,6196638
IN,under18,2003,1582560
IN,total,2004,6233007
IN,under18,2004,1586281
IN,total,2001,6127760
IN,under18,2001,1579527
IN,total,2002,6155967
IN,under18,2002,1580814
IN,total,1999,6044970
IN,under18,1999,1566079
IN,total,2000,6091866
IN,under18,2000,1574989
IN,total,1997,5955267
IN,under18,1997,1539270
IN,under18,1998,1551960
IN,total,1998,5998881
IN,under18,1996,1517961
IN,total,1996,5906013
IN,total,1995,5851459
IN,under18,1995,1507916
IN,under18,1992,1461650
IN,total,1992,5674547
IN,total,1993,5739019
IN,under18,1993,1473007
IN,under18,1994,1491802
IN,total,1994,5793526
IN,total,1991,5616388
IN,under18,1991,1450759
IN,under18,1990,1437209
IN,total,1990,5557798
IA,under18,1990,719366
IA,total,1990,2781018
IA,total,1991,2797613
IA,under18,1991,724446
IA,under18,1994,728397
IA,total,1994,2850746
IA,total,1993,2836972
IA,under18,1993,727751
IA,under18,1992,724798
IA,total,1992,2818401
IA,total,1995,2867373
IA,under18,1995,726961
IA,under18,1996,729177
IA,total,1996,2880001
IA,under18,1998,729943
IA,total,1998,2902872
IA,total,1997,2891119
IA,under18,1997,729806
IA,total,2000,2929067
IA,under18,2000,733337
IA,total,1999,2917634
IA,under18,1999,732671
IA,total,2002,2934234
IA,under18,2002,723685
IA,total,2001,2931997
IA,under18,2001,728601
IA,total,2004,2953635
IA,under18,2004,718708
IA,total,2003,2941999
IA,under18,2003,720102
IA,total,2006,2982644
IA,under18,2006,721703
IA,total,2005,2964454
IA,under18,2005,718488
IA,total,2008,3016734
IA,under18,2008,725658
IA,total,2007,2999212
IA,under18,2007,723632
IA,under18,2013,724032
IA,total,2009,3032870
IA,under18,2009,726969
IA,total,2013,3090416
IA,total,2010,3050314
IA,under18,2010,727717
IA,total,2011,3064102
IA,under18,2011,725522
IA,under18,2012,723917
IA,total,2012,3075039
KS,total,2012,2885398
KS,under18,2012,726668
KS,under18,2011,726787
KS,total,2011,2869548
KS,under18,2010,727729
KS,total,2010,2858910
KS,total,2013,2893957
KS,total,2009,2832704
KS,under18,2009,721841
KS,under18,2013,724092
KS,total,2007,2783785
KS,under18,2007,711005
KS,total,2008,2808076
KS,under18,2008,714689
KS,total,2005,2745299
KS,under18,2005,704689
KS,total,2006,2762931
KS,under18,2006,705277
KS,total,2003,2723004
KS,under18,2003,707847
KS,total,2004,2734373
KS,under18,2004,705456
KS,total,2001,2702162
KS,under18,2001,710923
KS,total,2002,2713535
KS,under18,2002,709416
KS,total,1999,2678338
KS,under18,1999,713022
KS,total,2000,2693681
KS,under18,2000,713887
KS,total,1997,2635292
KS,under18,1997,704001
KS,under18,1998,710402
KS,total,1998,2660598
KS,under18,1996,696298
KS,total,1996,2614554
KS,total,1995,2601008
KS,under18,1995,694124
KS,under18,1992,680871
KS,total,1992,2532395
KS,total,1993,2556547
KS,under18,1993,687262
KS,under18,1994,693673
KS,total,1994,2580513
KS,total,1991,2498722
KS,under18,1991,672033
KS,under18,1990,662641
KS,total,1990,2481349
KY,under18,1990,945951
KY,total,1990,3694048
KY,total,1991,3722328
KY,under18,1991,951512
KY,under18,1994,981439
KY,total,1994,3849088
KY,total,1993,3812206
KY,under18,1993,971134
KY,under18,1992,963861
KY,total,1992,3765469
KY,total,1995,3887427
KY,under18,1995,984486
KY,under18,1996,987062
KY,total,1996,3919536
KY,under18,1998,997296
KY,total,1998,3985391
KY,total,1997,3952747
KY,under18,1997,1002609
KY,total,2000,4049021
KY,under18,2000,994984
KY,total,1999,4018053
KY,under18,1999,996382
KY,total,2002,4089875
KY,under18,2002,995251
KY,total,2001,4068132
KY,under18,2001,994105
KY,total,2004,4146101
KY,under18,2004,998459
KY,total,2003,4117170
KY,under18,2003,998485
KY,total,2006,4219239
KY,under18,2006,1011295
KY,total,2005,4182742
KY,under18,2005,1004020
KY,total,2008,4289878
KY,under18,2008,1022001
KY,total,2007,4256672
KY,under18,2007,1016288
KY,under18,2013,1014004
KY,total,2009,4317074
KY,under18,2009,1021710
KY,total,2013,4395295
KY,total,2010,4347698
KY,under18,2010,1023679
KY,total,2011,4366869
KY,under18,2011,1021926
KY,under18,2012,1017350
KY,total,2012,4379730
LA,total,2012,4602134
LA,under18,2012,1114620
LA,under18,2011,1116579
LA,total,2011,4575197
LA,under18,2010,1118576
LA,total,2010,4545392
LA,total,2013,4625470
LA,total,2009,4491648
LA,under18,2009,1114228
LA,under18,2013,1112957
LA,total,2007,4375581
LA,under18,2007,1096642
LA,total,2008,4435586
LA,under18,2008,1108728
LA,total,2005,4576628
LA,under18,2005,1177954
LA,total,2006,4302665
LA,under18,2006,1078779
LA,total,2003,4521042
LA,under18,2003,1188070
LA,total,2004,4552238
LA,under18,2004,1182731
LA,total,2001,4477875
LA,under18,2001,1204187
LA,total,2002,4497267
LA,under18,2002,1194819
LA,total,2000,4471885
LA,under18,2000,1217670
LA,total,1999,4460811
LA,under18,1999,1227167
LA,total,1997,4421072
LA,under18,1997,1239665
LA,under18,1998,1232984
LA,total,1998,4440344
LA,under18,1996,1244627
LA,total,1996,4398877
LA,total,1995,4378779
LA,under18,1995,1250112
LA,under18,1992,1237034
LA,total,1992,4293003
LA,total,1993,4316428
LA,under18,1993,1239161
LA,under18,1994,1247631
LA,total,1994,4347481
LA,total,1991,4253279
LA,under18,1991,1222330
LA,under18,1990,1205984
LA,total,1990,4221532
ME,under18,1990,308066
ME,total,1990,1231719
ME,total,1991,1237081
ME,under18,1991,309871
ME,under18,1994,311570
ME,total,1994,1242662
ME,total,1993,1242302
ME,under18,1993,310966
ME,under18,1992,310679
ME,total,1992,1238508
ME,total,1995,1243481
ME,under18,1995,309173
ME,under18,1996,307740
ME,total,1996,1249060
ME,under18,1998,304496
ME,total,1998,1259127
ME,total,1997,1254774
ME,under18,1997,305097
ME,total,1999,1266808
ME,under18,1999,302321
ME,total,2000,1277072
ME,under18,2000,301407
ME,total,2002,1295960
ME,under18,2002,298595
ME,total,2001,1285692
ME,under18,2001,300088
ME,total,2004,1313688
ME,under18,2004,294791
ME,total,2003,1306513
ME,under18,2003,296786
ME,total,2006,1323619
ME,under18,2006,288945
ME,total,2005,1318787
ME,under18,2005,292039
ME,total,2008,1330509
ME,under18,2008,282204
ME,total,2007,1327040
ME,under18,2007,286185
ME,under18,2013,261276
ME,total,2009,1329590
ME,under18,2009,277946
ME,total,2013,1328302
ME,total,2010,1327366
ME,under18,2010,273061
ME,total,2011,1327844
ME,under18,2011,268737
ME,under18,2012,264846
ME,total,2012,1328501
MD,total,2012,5884868
MD,under18,2012,1346235
MD,under18,2011,1348766
MD,total,2011,5840241
MD,under18,2010,1351983
MD,total,2010,5787193
MD,total,2013,5928814
MD,total,2009,5730388
MD,under18,2009,1353631
MD,under18,2013,1344522
MD,total,2007,5653408
MD,under18,2007,1369563
MD,total,2008,5684965
MD,under18,2008,1359214
MD,total,2005,5592379
MD,under18,2005,1382966
MD,total,2006,5627367
MD,under18,2006,1377756
MD,total,2003,5496269
MD,under18,2003,1379641
MD,total,2004,5546935
MD,under18,2004,1383450
MD,total,2001,5374691
MD,under18,2001,1366552
MD,total,2002,5440389
MD,under18,2002,1375354
MD,total,2000,5311034
MD,under18,2000,1356961
MD,total,1999,5254509
MD,under18,1999,1348659
MD,total,1997,5157328
MD,under18,1997,1321306
MD,under18,1998,1338727
MD,total,1998,5204464
MD,under18,1996,1303816
MD,total,1996,5111986
MD,total,1995,5070033
MD,under18,1995,1300695
MD,under18,1992,1235498
MD,total,1992,4923369
MD,total,1993,4971889
MD,under18,1993,1261738
MD,under18,1994,1280772
MD,total,1994,5023060
MD,total,1991,4867641
MD,under18,1991,1208898
MD,under18,1990,1180426
MD,total,1990,4799770
MA,under18,1990,1353806
MA,total,1990,6022639
MA,total,1991,6018470
MA,under18,1991,1375110
MA,under18,1994,1437069
MA,total,1994,6095241
MA,total,1993,6060569
MA,under18,1993,1415724
MA,under18,1992,1390188
MA,total,1992,6028709
MA,total,1995,6141445
MA,under18,1995,1453489
MA,under18,1996,1468614
MA,total,1996,6179756
MA,under18,1998,1491652
MA,total,1998,6271838
MA,total,1997,6226058
MA,under18,1997,1478203
MA,total,1999,6317345
MA,under18,1999,1495818
MA,total,2000,6361104
MA,under18,2000,1501334
MA,total,2001,6397634
MA,under18,2001,1505028
MA,total,2002,6417206
MA,under18,2002,1502652
MA,total,2004,6412281
MA,under18,2004,1479541
MA,total,2003,6422565
MA,under18,2003,1493372
MA,total,2006,6410084
MA,under18,2006,1450202
MA,total,2005,6403290
MA,under18,2005,1464140
MA,total,2008,6468967
MA,under18,2008,1429727
MA,total,2007,6431559
MA,under18,2007,1439757
MA,under18,2013,1393946
MA,total,2009,6517613
MA,under18,2009,1422935
MA,total,2013,6692824
MA,total,2010,6563263
MA,under18,2010,1415962
MA,total,2011,6606285
MA,under18,2011,1407240
MA,under18,2012,1399417
MA,total,2012,6645303
MI,total,2012,9882519
MI,under18,2012,2269365
MI,under18,2011,2299116
MI,total,2011,9874589
MI,under18,2010,2333121
MI,total,2010,9876149
MI,total,2013,9895622
MI,total,2009,9901591
MI,under18,2009,2372603
MI,under18,2013,2245201
MI,total,2007,10001284
MI,under18,2007,2470063
MI,total,2008,9946889
MI,under18,2008,2418879
MI,total,2005,10051137
MI,under18,2005,2531839
MI,total,2006,10036081
MI,under18,2006,2503548
MI,total,2003,10041152
MI,under18,2003,2569080
MI,total,2004,10055315
MI,under18,2004,2553314
MI,total,2002,10015710
MI,under18,2002,2584310
MI,total,2001,9991120
MI,under18,2001,2593310
MI,total,2000,9952450
MI,under18,2000,2596114
MI,total,1999,9897116
MI,under18,1999,2591944
MI,total,1997,9809051
MI,under18,1997,2582270
MI,under18,1998,2586343
MI,total,1998,9847942
MI,under18,1996,2569745
MI,total,1996,9758645
MI,total,1995,9676211
MI,under18,1995,2556799
MI,under18,1992,2501765
MI,total,1992,9479065
MI,total,1993,9540114
MI,under18,1993,2522249
MI,under18,1994,2535196
MI,total,1994,9597737
MI,total,1991,9400446
MI,under18,1991,2484957
MI,under18,1990,2459633
MI,total,1990,9311319
MN,under18,1990,1176680
MN,total,1990,4389857
MN,total,1991,4440859
MN,under18,1991,1191207
MN,under18,1994,1238949
MN,total,1994,4610355
MN,total,1993,4555956
MN,under18,1993,1226723
MN,under18,1992,1213068
MN,total,1992,4495572
MN,total,1995,4660180
MN,under18,1995,1245932
MN,under18,1996,1252722
MN,total,1996,4712827
MN,under18,1998,1275940
MN,total,1998,4813412
MN,total,1997,4763390
MN,under18,1997,1264250
MN,total,1999,4873481
MN,under18,1999,1283102
MN,total,2000,4933692
MN,under18,2000,1289715
MN,total,2001,4982796
MN,under18,2001,1291261
MN,total,2002,5018935
MN,under18,2002,1288795
MN,total,2004,5087713
MN,under18,2004,1281946
MN,total,2003,5053572
MN,under18,2003,1283687
MN,total,2006,5163555
MN,under18,2006,1282381
MN,total,2005,5119598
MN,under18,2005,1280557
MN,total,2008,5247018
MN,under18,2008,1284179
MN,total,2007,5207203
MN,under18,2007,1285074
MN,under18,2013,1279111
MN,total,2009,5281203
MN,under18,2009,1284103
MN,total,2013,5420380
MN,total,2010,5310337
MN,under18,2010,1282693
MN,total,2011,5347108
MN,under18,2011,1280424
MN,under18,2012,1278050
MN,total,2012,5379646
MS,total,2012,2986450
MS,under18,2012,742941
MS,under18,2011,747742
MS,total,2011,2977886
MS,under18,2010,754111
MS,total,2010,2970047
MS,total,2013,2991207
MS,total,2009,2958774
MS,under18,2009,758539
MS,under18,2013,737432
MS,total,2007,2928350
MS,under18,2007,761171
MS,total,2008,2947806
MS,under18,2008,760572
MS,total,2005,2905943
MS,under18,2005,760870
MS,total,2006,2904978
MS,under18,2006,756990
MS,total,2003,2868312
MS,under18,2003,759447
MS,total,2004,2889010
MS,under18,2004,760410
MS,total,2002,2858681
MS,under18,2002,763148
MS,total,2001,2852994
MS,under18,2001,768418
MS,total,2000,2848353
MS,under18,2000,774353
MS,total,1999,2828408
MS,under18,1999,775662
MS,total,1997,2777004
MS,under18,1997,774832
MS,under18,1998,773721
MS,total,1998,2804834
MS,under18,1996,769680
MS,total,1996,2748085
MS,total,1995,2722659
MS,under18,1995,767892
MS,under18,1992,750224
MS,total,1992,2623734
MS,total,1993,2655100
MS,under18,1993,755820
MS,under18,1994,763795
MS,total,1994,2688992
MS,total,1991,2598733
MS,under18,1991,738911
MS,under18,1990,733660
MS,total,1990,2578897
MO,under18,1990,1316423
MO,total,1990,5128880
MO,total,1991,5170800
MO,under18,1991,1332306
MO,under18,1994,1378700
MO,total,1994,5324497
MO,total,1993,5271175
MO,under18,1993,1365903
MO,under18,1992,1349729
MO,total,1992,5217101
MO,under18,1996,1408732
MO,total,1996,5431553
MO,total,1995,5378247
MO,under18,1995,1393554
MO,under18,1998,1428999
MO,total,1998,5521765
MO,total,1997,5481193

USA,total,1991,252980942
USA,under18,1991,65313018
USA,under18,1992,66509177
USA,total,1992,256514231
USA,total,1993,259918595
USA,under18,1993,67594938
USA,under18,1994,68640936
USA,total,1994,263125826
USA,under18,1995,69473140
USA,under18,1996,70233512
USA,total,1995,266278403
USA,total,1996,269394291
USA,total,1997,272646932
USA,under18,1997,70920738
USA,under18,1998,71431406
USA,total,1998,275854116
USA,under18,1999,71946051
USA,total,2000,282162411
USA,under18,2000,72376189
USA,total,1999,279040181
USA,total,2001,284968955
USA,under18,2001,72671175
USA,total,2002,287625193
USA,under18,2002,72936457
USA,total,2003,290107933
USA,under18,2003,73100758
USA,total,2004,292805298
USA,under18,2004,73297735
USA,total,2005,295516599
USA,under18,2005,73523669
USA,total,2006,298379912
USA,under18,2006,73757714
USA,total,2007,301231207
USA,under18,2007,74019405
USA,total,2008,304093966
USA,under18,2008,74104602
USA,under18,2013,73585872
USA,total,2013,316128839
USA,total,2009,306771529
USA,under18,2009,74134167
USA,under18,2010,74119556
USA,total,2010,309326295
USA,under18,2011,73902222
USA,total,2011,311582564
USA,under18,2012,73708179
USA,total,2012,313873685
state,area (sq. mi)
Alabama,52423
Alaska,656425
Arizona,114006
Arkansas,53182
California,163707
Colorado,104100
Connecticut,5544
Delaware,1954
Florida,65758
Georgia,59441
Hawaii,10932
Idaho,83574
Illinois,57918
Indiana,36420
Iowa,56276
Kansas,82282
Kentucky,40411
Louisiana,51843
Maine,35387
Maryland,12407
Massachusetts,10555
Michigan,96810
Minnesota,86943
Mississippi,48434
Missouri,69709
Montana,147046
Nebraska,77358
Nevada,110567
New Hampshire,9351
New Jersey,8722
New Mexico,121593
New York,54475
North Carolina,53821
North Dakota,70704
Ohio,44828
Oklahoma,69903
Oregon,98386
Pennsylvania,46058
Rhode Island,1545
South Carolina,32007
South Dakota,77121
Tennessee,42146
Texas,268601
Utah,84904
Vermont,9615
Virginia,42769
Washington,71303
West Virginia,24231
Wisconsin,65503
Wyoming,97818
District of Columbia,68
Puerto Rico,3515

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   835  100   835    0     0   3047      0 --:--:-- --:--:-- --:--:--  3069

"state","abbreviation"
"Alabama","AL"
"Alaska","AK"
"Arizona","AZ"
"Arkansas","AR"
"California","CA"
"Colorado","CO"
"Connecticut","CT"
"Delaware","DE"
"District of Columbia","DC"
"Florida","FL"
"Georgia","GA"
"Hawaii","HI"
"Idaho","ID"
"Illinois","IL"
"Indiana","IN"
"Iowa","IA"
"Kansas","KS"
"Kentucky","KY"
"Louisiana","LA"
"Maine","ME"
"Montana","MT"
"Nebraska","NE"
"Nevada","NV"
"New Hampshire","NH"
"New Jersey","NJ"
"New Mexico","NM"
"New York","NY"
"North Carolina","NC"
"North Dakota","ND"
"Ohio","OH"
"Oklahoma","OK"
"Oregon","OR"
"Maryland","MD"
"Massachusetts","MA"
"Michigan","MI"
"Minnesota","MN"
"Mississippi","MS"
"Missouri","MO"
"Pennsylvania","PA"
"Rhode Island","RI"
"South Carolina","SC"
"South Dakota","SD"
"Tennessee","TN"
"Texas","TX"
"Utah","UT"
"Vermont","VT"
"Virginia","VA"
"Washington","WA"
"West Virginia","WV"
"Wisconsin","WI"
"Wyoming","WY"

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   872  100   872    0     0   3488      0 --:--:-- --:--:-- --:--:--  3502

11.1 Save the csv files as follow:
     
     state-population as pop
     state-areas as areas
     state-abbrevs as abbrevs

In [423]:
pop = pd.read_csv("state-population.csv")
areas = pd.read_csv("state-areas.csv")
abbrevs = pd.read_csv("state-abbrevs.csv")

In [424]:
#enter solution

11.2 Print the first five rows of each dataset

In [425]:
print(pop.head()), print(areas.head()), print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

(None, None, None)

In [426]:
#enter solution

11.3 Merge the df's pop and abbrevs, so you get the following columns:
    
    state/region | ages | year | population | state

In [429]:
merged = pd.merge(pop, abbrevs, how= "outer", left_on= "state/region", right_on = "abbreviation")
merged = merged.drop("abbreviation", 1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [430]:
#enter solution

11.4 Check if there are any Null values

In [431]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [432]:
#enter solution

11.5 Show the data with the Null value

In [437]:
print(merged[merged["population"].isnull()])
print(merged[merged["state"].isnull()])

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN
2453           PR  under18  1993         NaN   NaN
2454           PR  under18  1992         NaN   NaN
2455           PR    total  1992         NaN   NaN
2456           PR  under18  1994         NaN   NaN
2457           PR    total  1994         NaN   NaN
2458           PR    total  1995         NaN   NaN
2459           PR  under18  1995         NaN   NaN
2460           PR  under18  1996         NaN   NaN
2461           PR    total  1996         NaN   NaN
2462           PR  under18  1998         NaN   NaN
2463           PR    total  1998         NaN   NaN
2464           PR    total  1997         NaN   NaN
2465           PR  under18  1997         NaN   NaN
2466           PR    total  1999         NaN   NaN
2467           PR  under18  1999         NaN   NaN
     state/region     ages  year   population state
2448           PR  under18  1990          NaN   NaN
2449           PR    total  1990          NaN   NaN
2450           PR    total  1991          NaN   NaN
2451           PR  under18  1991          NaN   NaN
2452           PR    total  1993          NaN   NaN
...           ...      ...   ...          ...   ...
2539          USA    total  2010  309326295.0   NaN
2540          USA  under18  2011   73902222.0   NaN
2541          USA    total  2011  311582564.0   NaN
2542          USA  under18  2012   73708179.0   NaN
2543          USA    total  2012  313873685.0   NaN

[96 rows x 5 columns]

In [434]:
#enter solution

11.6 Find out which regions lack the data

In [438]:
merged.loc[merged["state"].isnull(), "state/region"].unique()

array(['PR', 'USA'], dtype=object)

In [439]:
#enter solution

11.7 Change "state" of "region" "PR" and "USA" to "Puerto Rico" and "United States", after check again for Null values

In [440]:
merged.loc[merged["state/region"] == "PR", "state"] = "Puerto Rico"
merged.loc[merged["state/region"] == "USA", "state"] = "United States"
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [441]:
#enter solution

11.8 Merge the dataset with the df **areas**

In [444]:
final = pd.merge(merged,areas, on="state", how="left")
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [445]:
#enter solution

11.9 Check for Null values

In [446]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [447]:
#enter solution

11.10 Check which regions have a Null value in the area column

In [448]:
final["state"][final["area (sq. mi)"].isnull()].unique()

array(['United States'], dtype=object)

In [449]:
#enter solution

11.11 Drop the rows with the Null values

In [451]:
final.dropna(inplace= True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [450]:
#enter solution

11.12 Query all data, where year is equal to 2010 and ages is equal to "total"

In [453]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [454]:
#enter solution

11.13 Set the column "state" as index

In [457]:
data2010.set_index("state", inplace= True)
data2010.head()

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0        52423.0
Alaska               AK  total  2010    713868.0       656425.0
Arizona              AZ  total  2010   6408790.0       114006.0
Arkansas             AR  total  2010   2922280.0        53182.0
California           CA  total  2010  37333601.0       163707.0

In [458]:
#enter solution

11.14 Compute the density and save it in a variable

In [460]:
density = data2010["population"] / data2010["area (sq. mi)"]
density.head()

state
Alabama        91.287603
Alaska          1.087509
Arizona        56.214497
Arkansas       54.948667
California    228.051342
dtype: float64

In [461]:
#enter solution

11.15 Display the dataset in order, showing the top 5 highest densities

In [462]:
density.sort_values(ascending= False, inplace= True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [463]:
#enter solution

11.16 Display the lowest 5 densities

In [464]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [465]:
#enter solution

#### Task 12 Aggregation and Grouping
    
    get the planets dataset from seaborn

12.1 Import seaborn

In [466]:
import seaborn as sns

In [467]:
#enter solution

12.2 Save the planets dataset in a variable

In [468]:
planets = sns.load_dataset("planets")

In [469]:
#enter solution

12.3 Show the shape of the dataset

In [470]:
planets.shape

(1035, 6)

In [471]:
#enter solution

12.4 Show the first five rows of the dataset

In [472]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [473]:
#enter solution

12.5 Drop the Null values of the data and show the description of the dataset

In [474]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [475]:
#enter solution

12.6 Group the following df by the column "key" and get the sum for each value

In [478]:
df = pd.DataFrame({"key": ["A", "B", "C", "A", "B", "C"], "data": range(6)},columns= ["key", "data"])
print(df)
df.groupby("key").sum()

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

     data
key
A       3
B       5
C       7

In [479]:
#enter solution

12.7 Get the median of the "orbital_period" column for the df **planets** grouped by the column "method"

In [480]:
planets.groupby("method")["orbital_period"].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [481]:
#enter solution

12.8 Get the description for the column "year" of the DataFrame grouped by column "method"

In [482]:
planets.groupby("method")["year"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [487]:
#enter solution

12.9 Get the minimun, median and max for each other column grouped by the column "key"

In [491]:
rng = np.random.RandomState(0)
df = pd.DataFrame({"key": ["A", "B", "C", "A", "B", "C"], 
                  "data1": range(6), 
                  "data2": rng.randint(0,10,6)}, 
                  columns = ["key", "data1", "data2"])
print(df)

df.groupby("key").aggregate(["min", np.median, max])

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [492]:
#enter solution

12.10 Use the following function to filter the dataset **df** to get the grouped-by "key" data where the standard-deviation is greater than 4

In [494]:
def filter_func(x):
    return x["data2"].std() > 4

print(df), print(df.groupby("key").std())
print(df.groupby("key").filter(filter_func))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [495]:
#enter solution

12.11 Transform the dataset, grouping by "key" and transform the data by compute x - x.mean()

In [497]:
df.groupby("key").transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [498]:
#enter solution

12.12 Create a new DataFrame where each unique value in the column "key" gets devided by the sum of the same key

In [501]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x["data1"] /= x["data2"].sum()
    return x

print(df); print(df.groupby("key").apply(norm_by_data2))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [502]:
#enter solution

#### Task 13 Pivot Tables